; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p15---int100n150-m25---int100c150---s301---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level1 level5 level6)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level2 level5 level7)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level3 level5 level8)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level4 level5 level9)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level5 level5 level10)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level6 level5 level11)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level7 level5 level12)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level8 level5 level13)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level9 level5 level14)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level10 level5 level15)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level11 level5 level16)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level12 level5 level17)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level13 level5 level18)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level14 level5 level19)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level15 level5 level20)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level16 level5 level21)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level17 level5 level22)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level18 level5 level23)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level19 level5 level24)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level20 level5 level25)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level21 level5 level26)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level22 level5 level27)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level23 level5 level28)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level24 level5 level29)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level25 level5 level30)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level26 level5 level31)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level27 level5 level32)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level28 level5 level33)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level29 level5 level34)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level30 level5 level35)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level31 level5 level36)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level32 level5 level37)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level33 level5 level38)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level34 level5 level39)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level35 level5 level40)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level36 level5 level41)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level37 level5 level42)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level38 level5 level43)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level39 level5 level44)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level40 level5 level45)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level41 level5 level46)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level42 level5 level47)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level43 level5 level48)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level44 level5 level49)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level45 level5 level50)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level46 level5 level51)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level47 level5 level52)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level48 level5 level53)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level49 level5 level54)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level50 level5 level55)
(sum level50 level19 level69)
(sum level50 level21 level71)
(sum level51 level5 level56)
(sum level51 level19 level70)
(sum level51 level21 level72)
(sum level52 level5 level57)
(sum level52 level19 level71)
(sum level53 level5 level58)
(sum level53 level19 level72)
(sum level54 level5 level59)
(sum level55 level5 level60)
(sum level56 level5 level61)
(sum level57 level5 level62)
(sum level58 level5 level63)
(sum level59 level5 level64)
(sum level60 level5 level65)
(sum level61 level5 level66)
(sum level62 level5 level67)
(sum level63 level5 level68)
(sum level64 level5 level69)
(sum level65 level5 level70)
(sum level66 level5 level71)
(sum level67 level5 level72)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level21 l2 l1)

(at t0 l1)
(fuel t0 level72)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l0)
(at p7 l1)
(at p8 l0)
(at p9 l2)
(at p10 l0)
(at p11 l0)
(at p12 l2)
(at p13 l2)
(at p14 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l0)
(at p5 l1)
(at p6 l1)
(at p7 l2)
(at p8 l2)
(at p9 l1)
(at p10 l2)
(at p11 l1)
(at p12 l1)
(at p13 l0)
(at p14 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 15
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 15
3. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 15
4. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 15
5. (drive t0 l1 l0 level67 level5 level72)
   deleted: (at t0 l1) (fuel t0 level72)
   added: (at t0 l0) (fuel t0 level67)
   goals met: 0 of 15
6. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 15
7. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 15
8. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 15
9. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 0 of 15
10. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 15
11. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 15
12. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 15
13. (drive t0 l0 l2 level48 level19 level67)
   deleted: (at t0 l0) (fuel t0 level67)
   added: (at t0 l2) (fuel t0 level48)
   goals met: 0 of 15
14. (load p12 t0 l2)
   deleted: (at p12 l2)
   added: (in p12 t0)
   goals met: 0 of 15
15. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 0 of 15
16. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 15
17. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 15
18. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 1 of 15
19. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 2 of 15
20. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 15
21. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 4 of 15
22. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 5 of 15
23. (drive t0 l2 l0 level29 level19 level48)
   deleted: (at t0 l2) (fuel t0 level48)
   added: (at t0 l0) (fuel t0 level29)
   goals met: 5 of 15
24. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 6 of 15
25. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 7 of 15
26. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 8 of 15
27. (drive t0 l0 l1 level24 level5 level29)
   deleted: (at t0 l0) (fuel t0 level29)
   added: (at t0 l1) (fuel t0 level24)
   goals met: 8 of 15
28. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 9 of 15
29. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 10 of 15
30. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 11 of 15
31. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 12 of 15
32. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 13 of 15
33. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 14 of 15
34. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 15 of 15
